Courses/7140/Lectures/2020-09-01/index.org
# -*- mode: org -*-
#+DATE: 2020-09-01
#+TITLE: CS7140 Adv Software Engineering 2020-09-01
#+AUTHOR: Prabhaker Mateti
#+HTML_LINK_UP: ../
#+HTML_LINK_HOME: ../../Top/
#+HTML_HEAD: <style> P {text-align: justify} code, pre {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2020 <a href=\"https://cecs.wright.edu/~pmateti\"> cecs.wright.edu/~pmateti</a>  %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:nil

* Announcements/ Reminders

1. Action Item: Project Work. Form into teams of 3.  Due: Sep 07, 2020 11:59 PM
2. Action Item: Project Selection.  Due: Sep 07, 2020 11:59 PM
3. Action Item for me: Beyond this due date.

* Agenda

** Topics for Today

1. Assertions, Specs,  Design, VHLL, DNF, Tools [Links are on Course Home Page]
2. Introduce the above using DNF (Dutch National Flag Problem)

** Tools (For Now)

3. The following are arguably "the best" and I would
   like to see that you use them (at least for a few weeks).
   1. https://www.jetbrains.com/idea/ IDE for Java, Kotlin, and Scala.
      Now part of Android Studio.  Free.
   2. https://visualstudio.microsoft.com/ IDE for (mainly) C and C++.
      Free.
   3. https://github.com/ Repository.  Free.  Produce a "cover page" ASAP.
   4. https://en.wikipedia.org/wiki/Markdown From this *.md file you
      can generate *.pdf.  Use your choice of (free) tools.
   5. You must use your selection of "Collaboration Tools".  Examples:
      google-meet, slack, teams, trello, webex, zoom, etc.

1. This course expects you to develop skills in using several free
   (usually FOSS) tools beyond the above.  Exam questions on these do
   show up.


** Exercises

1. Exercises => No turn in. By all means, post your solution, and QAs
   to Pilot Discussion.
1. Exercise: Create a DNF program in both C++ and Java using the
   tools.  Use assertions as supported by C++ and Java.  Should
   include "pretty good" testing.  Found any bugs?
1. Exercises: Specify all the remaining problems mentioned in
   [[../Overview/simple-problems.org]] .  Skip design etc for now.  [Must
   be your own work.  Cut-n-paste of something you ran into is
   seriously frowned upon.]


* References

1. [[../Specs/index.org]]  More lecture time later on this.


* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:

