Courses/7140/Lectures/2020-09-01/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-02 Wed 12:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CS7140 Adv Software Engineering 2020-09-01</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">CS7140 Adv Software Engineering 2020-09-01</h1>

<div id="outline-container-orgab06caf" class="outline-2">
<h2 id="orgab06caf"><span class="section-number-2">1</span> Announcements/ Reminders</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Action Item: Project Work. Form into teams of 3.  Due: Sep 07, 2020 11:59 PM</li>
<li>Action Item: Project Selection.  Due: Sep 07, 2020 11:59 PM</li>
<li>Action Item for me: Beyond this due date.</li>
</ol>
</div>
</div>

<div id="outline-container-org598a11b" class="outline-2">
<h2 id="org598a11b"><span class="section-number-2">2</span> Agenda</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org128eb9a" class="outline-3">
<h3 id="org128eb9a"><span class="section-number-3">2.1</span> Topics for Today</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Assertions, Specs,  Design, VHLL, DNF, Tools [Links are on Course Home Page]</li>
<li>Introduce the above using DNF (Dutch National Flag Problem)</li>
</ol>
</div>
</div>

<div id="outline-container-org05d6792" class="outline-3">
<h3 id="org05d6792"><span class="section-number-3">2.2</span> Tools (For Now)</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>The following are arguably "the best" and I would
like to see that you use them (at least for a few weeks).
<ol class="org-ol">
<li><a href="https://www.jetbrains.com/idea/">https://www.jetbrains.com/idea/</a> IDE for Java, Kotlin, and Scala.
Now part of Android Studio.  Free.</li>
<li><a href="https://visualstudio.microsoft.com/">https://visualstudio.microsoft.com/</a> IDE for (mainly) C and C++.
Free.</li>
<li><a href="https://github.com/">https://github.com/</a> Repository.  Free.  Produce a "cover page" ASAP.</li>
<li><a href="https://en.wikipedia.org/wiki/Markdown">https://en.wikipedia.org/wiki/Markdown</a> From this *.md file you
can generate *.pdf.  Use your choice of (free) tools.</li>
<li>You must use your selection of "Collaboration Tools".  Examples:
google-meet, slack, teams, trello, webex, zoom, etc.</li>
</ol></li>

<li>This course expects you to develop skills in using several free
(usually FOSS) tools beyond the above.  Exam questions on these do
show up.</li>
</ol>
</div>
</div>


<div id="outline-container-orgfc94237" class="outline-3">
<h3 id="orgfc94237"><span class="section-number-3">2.3</span> Exercises</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Exercises =&gt; No turn in. By all means, post your solution, and QAs
to Pilot Discussion.</li>
<li>Exercise: Create a DNF program in both C++ and Java using the
tools.  Use assertions as supported by C++ and Java.  Should
include "pretty good" testing.  Found any bugs?</li>
<li>Exercises: Specify all the remaining problems mentioned in
<a href="../Overview/simple-problems.html">../Overview/simple-problems.html</a> .  Skip design etc for now.  [Must
be your own work.  Cut-n-paste of something you ran into is
seriously frowned upon.]</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org1cedf7e" class="outline-2">
<h2 id="org1cedf7e"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="../Specs/index.html">../Specs/index.html</a>  More lecture time later on this.</li>
</ol>
</div>
</div>


<div id="outline-container-org00433ad" class="outline-2">
<h2 id="org00433ad"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 <a href="https://cecs.wright.edu/~pmateti"> cecs.wright.edu/~pmateti</a>  2020-09-01
</div>
</body>
</html>
